In [1]:
import pandas as pd
import seaborn

In [2]:
# Reading the data
df = pd.read_feather(path='assets/rfm-scores.feather')
df.head()

,Customer_ID,r_value,f_value,m_value,r_score,f_score,m_score,rfm_score,Group,Index
0,469662,176,6,102421.2,4,5,1,451,Potential Loyalists,3
1,3063877,323,1,980000.0,3,1,4,314,Promising,5
2,3184893,740,3,173257.0,2,5,2,252,At Risk,8
3,6888562,119,1,16514.0,5,1,1,511,New Customers,4
4,2533490,954,1,133028.0,1,1,2,112,Lost,11